app/controllers/nutritionist_controller.rb

SELECT "nutritionists".* FROM "nutritionists" INNER JOIN "clinics" ON "clinics"."id" = "nutritionists"."clinic_id" WHERE (city LIKE '%Porto%') AND (nutritionist_type LIKE '%Nutricionista Desportivo%') ORDER BY "nutritionists"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def search
    #devolve uma lista de nutricionistas, filtrada pelo tipo de nutricionista e pela cidade onde esta a sua clinica
    @nutritionists = Nutritionist.joins(:clinic).where(["city LIKE ?", "%#{params[:city]}%"])
                        .where(["nutritionist_type LIKE ?" , "%#{params[:nt_type]}%"])