app/controllers/nutritionist_controller.rb

  def search
    @nutritionist = Nutritionist.where(["name LIKE ?", "%#{params[:name]}%"]).first
---
SELECT "nutritionists".* FROM "nutritionists" WHERE (tutorial_name LIKE '%Nelson Sousa%') ORDER BY "nutritionists"."id" ASC LIMIT $1  [["LIMIT", 1]]