app/views/nutritionist/search.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."nutritionist_id" = $1  [["nutritionist_id", 1]]
---
                      <script>prices[<%= nutritionist.id %>] = []</script>
                      <% nutritionist.appointment.each do |appointment| %>

SELECT "appointments".* FROM "appointments" WHERE "appointments"."nutritionist_id" = $1 AND "appointments"."id" = $2 LIMIT $3  [["nutritionist_id", 1], ["id", 1], ["LIMIT", 1]]
---
                  <div class="col s11" style="margin-left: 2%">
                    <p id="appointment_price_<%= nutritionist.id %>"> <%= nutritionist.appointment.first().price %> €</p>